#coding=utf-8
#Version: V 1.0
author: 'WangSheng'
date: '2019/5/10 23:16'
"""
    厂家提供的各个区域管壁在不同负荷下的数据，拟合折线函数用
"""

#数据要在厂家提供的基础上 前后各自多加一个点

#省煤器出口吊挂管数据
x1 = [-1,10,12, 15, 20, 22,25,29.52,30,40] #出口压力
y1 = [300,300,315,335,360,370,370,370,370,370]#报警温度
title1 = '省煤器出口吊挂管 厂家提供数据'

#顶棚出口
x2 = [-1,9.97,15.66,21.36,27.06,28.34,40]
y2 = [540,540,525,500,475,470,470]
title2 = '顶棚出口 厂家提供数据'

#水平烟道侧包墙壁
x3 = [-1,9.87,15.51,21.15,26.79,28.02,40]
y3 = [540,540,530,520,510,505,505]
title3 = '水平烟道侧包墙壁 厂家提供数据'

#后竖井包墙管38
x4 = [-1,9.87,15.51,21.15,26.79,28.02,40]
y4 = [540,540,535,515,505,500,500]
title4 = '后竖井包墙管38 厂家提供数据'

#后竖井包墙管51
x5 = [-1,9.87,15.51,21.15,26.79,28.02,40]
y5 = [540,540,530,510,495,490,490]
title5 = '后竖井包墙管51 厂家提供数据'

#低温过热器出口
x6 = [-1,9.7,15.25,20.79,26.33,27.63,40]
y6 = [575,575,560,540,520,515,515]
title6 = '低温过热器出口 厂家提供数据'

#屏式过热器45
x7 = [-1,9.6,15.09,20.57,26.06,27.31,40]
y7 = [630,630,630,615,605,600,600]
title7 = '屏式过热器45 厂家提供数据'


#屏式过热器51
x8 = [-1,9.6,15.09,20.57,26.06,27.31,40]
y8 = [630,630,630,620,605,600,600]
title8 = '屏式过热器51 厂家提供数据'

#高温过热器45出口
x9 = [-1,9.33,14.67,20,25.34,26.58,40]
y9 = [632,632,632,612,597,594,594]
title9 = '高温过热器出口 厂家提供数据'

#高温过热器51出口
x10 = [-1,9.33,14.67,20,25.34,26.58,40]
y10 = [632,632,625,602,587,584,584]
title10 = '高温过热器出口51 厂家提供数据'

#低温再热器出口
x11 = [-1,4.75,5.07,40]
y11 = [570,570,565,565]
title11 = '低温再热器出口 厂家提供数据'

#高温再热器出口
x12 = [-1,4.75,5.07,40]
y12 = [635,635,630,630]
title12 = '高温再热器出口 厂家提供数据'